#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 15813                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: mtslzx <boj.kr/u/mtslzx>                    +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/15813                          #+#        #+#      #+#     #
#    Solved: 2023/08/17 22:20:40 by mtslzx        ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

# https://blockdmask.tistory.com/544 파이썬에서 ASCII코드를 변환해주는 함수.

input()
score = 0
for i in list(input()):
    score += ord(i)-64  # 처음에 =+로 했다가 값이 누적되지 않길래 당황.. ord() 함수는 입력된 문자열을 아스키코드 10진수로 출력하고, A를 1점으로 맞추기 위해 -64를 해준다.
print(score)