#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 5032                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: mtslzx <boj.kr/u/mtslzx>                    +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/5032                           #+#        #+#      #+#     #
#    Solved: 2023/09/10 23:05:36 by mtslzx        ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

e, f, c = map(int, input().split()); e = e + f; f = 0
while True:  
    e = e // c
    f += e
    if e // c == 0:
        if e % c == 0: f += e % c
        break # 가지고 있는 빈 병을 더 이상 새 병으로 바꿀 수 없는 경우에 종료된다.
print(f)

# BUG: 나머지를 고려 안함 ㅋㅋㅋㅋㅋ
# TODO: 다시 만들자.
# 10
# !5
# 1 !2
# 1 !1
# !1
